PureEngineering/PUREmodules/nrf52/modules_examples/si1153_ble_test/main.c
}


int8_t run_lis2de_local_ble(nrf_drv_twi_t twi_master,ble_nus_t m_nus){
	uint8_t length = 19;
	uint8_t *ble_string[length];
//	uint8_t output_array[11];
	
	//uint8_t FIFO_SRC = read_byte(twi_master, Lis2de_DEVICE_ADDRESS, Lis2de_FIFO_SRC);
////	NRF_LOG_RAW_INFO("~~~~~~~~~~~~~~~~Lis2de_FIFO_SRC: %x.\r\n", FIFO_SRC);
//	uint8_t who_am_i = lis2de_whoami(twi_master);
//	NRF_LOG_RAW_INFO("Accelerometer WhoamI: %x.\r\n", who_am_i);
	
//	uint8_t status = lis2de_readStatus(twi_master);
//	NRF_LOG_RAW_INFO("Accelerometer Status: %x.\r\n", status);

	int8_t OUT_X = lis2de_readOUT_X(twi_master);
//	NRF_LOG_RAW_INFO("Accelerometer OUTX: %x.\r\n", OUT_X);
//	float x_in_gravity = convert_to_gravity(OUT_X);
	sprintf((char *)ble_string, "lis2dex: %.2x \r\n",OUT_X);
	send_ble_data(m_nus,(uint8_t *)ble_string,length);
	

	int8_t OUT_Y = lis2de_readOUT_Y(twi_master);
//	NRF_LOG_RAW_INFO("Accelerometer OUTY: %x.\r\n", OUT_Y);
//	float y_in_gravity = convert_to_gravity(OUT_Y);
	sprintf((char *)ble_string, "lis2dey: %x \r\n",OUT_Y);
        send_ble_data(m_nus,(uint8_t *)ble_string,length);
	
	int8_t OUT_Z = lis2de_readOUT_Z(twi_master);
//	NRF_LOG_RAW_INFO("Accelerometer OUTZ: %x.\r\n", OUT_Z);
//	float z_in_gravity = convert_to_gravity(OUT_Z);
	//create_packet(z_in_gravity);
	printf((char *)ble_string, "lis2deZ: %x \r\n",OUT_Z);
        send_ble_data(m_nus,(uint8_t *)ble_string,length);

//	int8_t temp = lis2de_readTEMP_L(twi_master);
//	NRF_LOG_RAW_INFO("Accelerometer Temp: %x.\r\n", temp);
	

	return 0;

}


//Code that runs in main to read data from sensors that are on
void print_to_ble(void){
  //  if(lis2de_on){
       // run_lis2de_local_ble(m_twi_master,m_nus);
       //
        run_si1153_local_ble(m_twi_master, m_nus);
//    }
	
	
  /*  if(lis3mdl_on){
        run_lis3mdl_ble(m_twi_master,m_nus);
    }
    if(bme280_on){
        run_bme280_ble(m_twi_master,m_nus);
    }
    if(veml6075_on){
        run_veml6075_ble(m_twi_master,m_nus);
    }
    if(si1153_on){
        run_si1153_ble(m_twi_master,m_nus);
    }
    if(vl53l0_on){
    }
    if(apds9250_on){
        run_apds9250_ble(m_twi_master,m_nus);
    }
    if(p1234701ct_on){
        run_p1234701ct_ble(m_twi_master,m_nus);
    }
*/
}

APP_TIMER_DEF(sensor_loop_timer_id);

static void sensor_loop_handler(void * p_context)
{
   print_to_ble();  
}

static void create_sensor_timer()
{   
    uint32_t err_code;

    // Create timers
    err_code = app_timer_create(&sensor_loop_timer_id, APP_TIMER_MODE_REPEATED, sensor_loop_handler);
    APP_ERROR_CHECK(err_code);

     err_code = app_timer_start(sensor_loop_timer_id, APP_TIMER_TICKS(50, APP_TIMER_PRESCALER), NULL);
     APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */




int si1153_test(void)
{


	NRF_LOG_RAW_INFO("si1153 test\n\r");
	NRF_LOG_FLUSH();   
	NRF_LOG_RAW_INFO("reach before send_command \n\r");
	send_command(m_twi_master,Si1153_RESET_SW);
	nrf_delay_ms(10);
	//si1153_init(m_twi_master);
	NRF_LOG_RAW_INFO("reach after send_command \n\r");
	param_set(m_twi_master, Si1153_CHAN_LIST, 0x07);

	param_set(m_twi_master, Si1153_LED1_A, 0x3F);
	param_set(m_twi_master, Si1153_LED2_A, 0x3F);
	param_set(m_twi_master, Si1153_LED3_A, 0x3F);

	param_set(m_twi_master, Si1153_ADCCONFIG_0, 0x62);
	param_set(m_twi_master, Si1153_MEASCONFIG_0, 0x01);
	param_set(m_twi_master, Si1153_ADCSENS_0, 0x01);

	param_set(m_twi_master, Si1153_ADCCONFIG_1, 0x62);
	param_set(m_twi_master, Si1153_MEASCONFIG_1, 0x02);
	param_set(m_twi_master, Si1153_ADCSENS_1, 0x01);

	param_set(m_twi_master, Si1153_ADCCONFIG_2, 0x62);
	param_set(m_twi_master, Si1153_MEASCONFIG_2, 0x04);
	param_set(m_twi_master, Si1153_ADCSENS_2, 0x01);

	send_command(m_twi_master,Si1153_FORCE);
	
	
	NRF_LOG_FLUSH();   

	return 0;

}

int main(void)
{
    uint32_t err_code;
    bool erase_bonds;

    /* Initializing TWI master interface for SuperSensor */
    err_code = twi_master_init();
    APP_ERROR_CHECK(err_code);

    APP_ERROR_CHECK(NRF_LOG_INIT(NULL));

    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();

    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
    bsp_board_leds_init();

    //test_supersensor(m_twi_master);

  //NRF_LOG_RAW_INFO("UART Start!------->\n\r");
   err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
  // NRF_LOG_RAW_INFO("UART Start!------->\n\r");
    APP_ERROR_CHECK(err_code);
	
	si1153_test();
    NRF_LOG_RAW_INFO(",ch0, chan1, chan2\n\r");
	
    NRF_LOG_FLUSH();

    create_sensor_timer();

    // Enter main loop.
    for (;;)
    {
	//NRF_LOG_RAW_INFO("UART Start!------->\n\r");
	//SEGGER_RTT_TerminalOut(1, "Hello World!\n");
	NRF_LOG_FLUSH(); 
	err_code = sd_app_evt_wait();
	APP_ERROR_CHECK(err_code);
	
    }
	
}


/**
 * @}
 */
